{
  "videoId": "3L4YrGaR8E4",
  "title": "Rage Against The Machine - Bulls On Parade (Official HD Video)",
  "artist": "Rage Against The Machine",
  "song": "Bulls On Parade (Official HD Video)",
  "generatedAt": "2026-01-09T18:56:18.427876Z",
  "facts": [
    {
      "time": 10,
      "text": "Bulls on Parade was recorded in 1996 at Rage's self-built 'The Boat' studio in LA – a floating barge turned rock fortress!"
    },
    {
      "time": 25,
      "text": "Tom Morello invented the 'kill switch' guitar effect here, mimicking machine guns without any pedals!"
    },
    {
      "time": 40,
      "text": "Zack de la Rocha wrote lyrics protesting US arms sales – 'weapons not food, not homes, not shoes' rips Raytheon!"
    },
    {
      "time": 55,
      "text": "Morello's rig: Marshall stacks plus a bee-flavored fuzz pedal for that killer 'bulls on parade' roar!"
    },
    {
      "time": 70,
      "text": "1996: Rage refused to play MTV's Video Music Awards over corporate censorship beef!"
    },
    {
      "time": 85,
      "text": "Video shot guerrilla-style at Capitol Records building – cops shut it down mid-riot scene!"
    },
    {
      "time": 100,
      "text": "Director Peter Christopherson (Throbbing Gristle) filmed Zack crowd-surfing real fans in a mosh pit frenzy!"
    },
    {
      "time": 115,
      "text": "Band spray-painted 'Rage' on a US tank – nod to their anti-military protest roots!"
    },
    {
      "time": 130,
      "text": "Peaked at #2 on Billboard Mainstream Rock – banned from some radio for 'incendiary' lyrics!"
    },
    {
      "time": 145,
      "text": "1996 era: Rage headlined Lollapalooza protesting Ticketmaster monopoly – pure rebel fury!"
    },
    {
      "time": 160,
      "text": "Morello's uncle was Mexican President Lázaro Cárdenas – family history fuels their revolutionary fire!"
    },
    {
      "time": 175,
      "text": "Video features burning dollar bills symbolizing corporate greed – shot in one wild night!"
    },
    {
      "time": 190,
      "text": "Song inspired Occupy Wall Street chants – 'bulls on parade' became anti-corporate battle cry!"
    },
    {
      "time": 205,
      "text": "De la Rocha's rap style draws from Public Enemy – fused with metal for rap-rock revolution!"
    },
    {
      "time": 220,
      "text": "Evil Empire album debuted #1, selling 250K first week – Rage's biggest commercial roar!"
    },
    {
      "time": 235,
      "text": "Video banned from MTV rotation for 'violent imagery' – irony for a protest anthem!"
    },
    {
      "time": 250,
      "text": "1996: Rage reunited with ex-drummer Bryan Mantia briefly before Brad Wilk locked in!"
    },
    {
      "time": 265,
      "text": "Morello tuned guitar to drop D for that seismic riff – standard for their wall-of-sound assault!"
    }
  ]
}