{
  "videoId": "MW6E_TNgCsY",
  "title": "Everclear - Santa Monica (Official Music Video)",
  "artist": "Everclear",
  "song": "Santa Monica (Official Music Video)",
  "generatedAt": "2026-01-09T19:00:14.068024Z",
  "facts": [
    {
      "time": 10,
      "text": "Art Alexakis wrote 'Santa Monic' after fleeing abusive childhood in LA for a fresh start in Oregon!"
    },
    {
      "time": 25,
      "text": "'Santa Monica' is a bitter breakup anthem about an ex who chased Hollywood dreams and left him broken."
    },
    {
      "time": 40,
      "text": "Everclear's 1997 album So. So. Clean was named after Alexakis' heroin-addicted mom's insult to his messy house!"
    },
    {
      "time": 55,
      "text": "Art Alexakis survived a 1988 suicide attempt and homelessness before Everclear's breakthrough."
    },
    {
      "time": 70,
      "text": "The iconic beach bonfire scene was shot at Leo Carrillo State Park, a popular spot for SoCal parties."
    },
    {
      "time": 85,
      "text": "Video director Marc Webb later helmed massive hits like (500) Days of Summer and The Amazing Spider-Man!"
    },
    {
      "time": 100,
      "text": "Grunge was fading, pop ruled radio, but Everclear's post-grunge sound hit big in 1997's alt-rock scene."
    },
    {
      "time": 115,
      "text": "Peaked at #1 on Billboard's Modern Rock chart for 3 weeks, outselling many grunge holdovers."
    },
    {
      "time": 130,
      "text": "Song's released amid 1997's Hanson mania and Puff Daddy dominance – pure alt-rock rebellion!"
    },
    {
      "time": 145,
      "text": "Alexakis battled crippling agoraphobia during recording, channeling pain into the lyrics."
    },
    {
      "time": 160,
      "text": "Video features real LA beachgoers; no paid extras – captured authentic SoCal chaos."
    },
    {
      "time": 175,
      "text": "1997 saw Titanic's epic release and Diana's death – 'Santa Monica' was escapist summer rage."
    },
    {
      "time": 190,
      "text": "Over 5 million So. So. Clean copies sold; launched Everclear to headlining arena tours."
    },
    {
      "time": 205,
      "text": "Alexakis adopted his wife’s surname 'Everclear' from the grain alcohol for the band name."
    },
    {
      "time": 220,
      "text": "Charted during the dial-up internet era – fans shared grainy RealPlayer rips online."
    },
    {
      "time": 235,
      "text": "Video budget was modest $100K, but MTV rotation made it a visual staple of TRL's early days."
    },
    {
      "time": 250,
      "text": "Art lost his brother to a heroin OD at 34, inspiring anti-drug themes in his raw lyrics."
    },
    {
      "time": 265,
      "text": "Covered by Vitamin C in 2000; became a staple in teen rom-com soundtracks."
    }
  ]
}