{
  "videoId": "ru3gH27Fn6E",
  "title": "Beastie Boys - So What Cha Want",
  "artist": "Beastie Boys",
  "song": "So What Cha Want",
  "generatedAt": "2026-01-09T18:52:40.804333Z",
  "facts": [
    {
      "time": 10,
      "text": "The iconic \"shhh\" hand gesture? Inspired by a Spike Jonze prank on the Boys during video rehearsals!"
    },
    {
      "time": 25,
      "text": "Song recorded in 1992 at G-Son Studios with Mario Caldato Jr., who mixed it on a rare SSL 4000 console."
    },
    {
      "time": 40,
      "text": "Mike D wrote the opening line after a fan yelled it at him during a NYC street argument."
    },
    {
      "time": 55,
      "text": "MCA (Adam Yauch) battled cancer later but co-directed this video under pseudonym 'Nathanial Hörnblowér'."
    },
    {
      "time": 70,
      "text": "'Check it out' hook samples a 1970s funk record, flipped into hip-hop gold by the Dust Brothers."
    },
    {
      "time": 85,
      "text": "Video directed by Spike Jonze, who later helmed Jackass and Oscar-winning 'Here We Go Round the Mulberry Bush'."
    },
    {
      "time": 100,
      "text": "Peaked at #93 on Billboard Hot 100 but #3 on Modern Rock Tracks—radio loved it more than charts!"
    },
    {
      "time": 115,
      "text": "Ad-Rock's backwards pants in the video? A thrift store find that became 90s grunge fashion inspo."
    },
    {
      "time": 130,
      "text": "Released amid 1992 LA riots; lyrics' raw energy captured the era's urban tension perfectly."
    },
    {
      "time": 145,
      "text": "Beastie Boys donated video shoot profits to Hollywood NAACP after Rodney King verdict fallout."
    },
    {
      "time": 160,
      "text": "Mix Master Mike wasn't in the band yet—this track features their original DJ Hurricane on cuts."
    },
    {
      "time": 175,
      "text": "Video's dog-pee-on-MCA scene improvised when a stray pup wandered onto the junkyard set!"
    },
    {
      "time": 190,
      "text": "From platinum album 'Check Your Head,' blending punk, hip-hop, and funk—sold 3M+ copies."
    },
    {
      "time": 205,
      "text": "Diamond Dallas Page wrestling move 'People's Elbow'? He credits Beastie Boys' wild energy for it."
    },
    {
      "time": 220,
      "text": "Early 90s alt explosion: Nirvana, Pearl Jam peers; Beasties bridged rap-rock gap wide open."
    },
    {
      "time": 235,
      "text": "MCA rapped the bridge while battling tinnitus from years of deafening live shows."
    },
    {
      "time": 250,
      "text": "VH1's Pop Up Video ranked this #1 Beasties vid for its chaotic, junkyard slam-dance vibe."
    },
    {
      "time": 265,
      "text": "Sampled in Grand Theft Auto: San Andreas—millions blasted 'So What'cha Want' on virtual radios."
    }
  ]
}